# -*-coding:utf-8-*-
# @作者：haiyu.ma
# @创建日期：2020-11-10 22:53 
# @Software：PyCharm
# ----------------------------------------------------------------------------
print()
"""
按存值个数区分：
只能存一个值:可称为标量/原子类型---------------------------------------数字、字符串
可以存放多个值:可称为容器类型------------------------------------------列表、元组、字典
ps：集合也是容器类型，但是它与列表、元组、字典有区别，集合是把内容当做一个整体来使用，不是单独使用

按照访问方式区分：
直接访问:只能通过变量名访问整个值--------------------------------------数字
顺序访问:可以用索引访问指定的值,索引代表顺序,又称为序列类型-------------字符串、列表、元组
key访问:可以用key访问指定的值,又称为映射类型型-------------------------字典

按可变不可变区分：
可变类型：列表、字典、集合
不可变类型：数字、字符串、元组
"""
